In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("C:\pandas_experiment\pandas_indexing_slicing\data.csv")
df

   EmpID       Skill  Age      Pay     Name
0     21      Python   35  15000.0    Indhu
1     12      python   27      NaN   Karthi
2     15  JavaScript   32   5000.0   Palani
3      7  JavaScript   27  12000.0  Sarvesh
4     10      PYTHON   25   1000.0   Bindhu

### Selecting single column using standard indexing. Return type is series

In [3]:
df["Skill"]

0        Python
1        python
2    JavaScript
3    JavaScript
4        PYTHON
Name: Skill, dtype: object

In [4]:
type(df["Skill"])

pandas.core.series.Series

### Selecting multiple column using standard indexing.Return type is Dataframe

In [5]:
df[["EmpID","Skill"]]

   EmpID       Skill
0     21      Python
1     12      python
2     15  JavaScript
3      7  JavaScript
4     10      PYTHON

In [6]:
type(df[["EmpID","Skill"]])

pandas.core.frame.DataFrame

### Selecting row of indexes using standard indexing.Return type is Dataframe

In [7]:
df[0:2]

   EmpID   Skill  Age      Pay    Name
0     21  Python   35  15000.0   Indhu
1     12  python   27      NaN  Karthi

In [82]:
df[0:4:2]

   EmpID       Skill  Age      Pay    Name
0     21      Python   35  15000.0   Indhu
2     15  JavaScript   32   5000.0  Palani

In [83]:
df[::-1]

   EmpID       Skill  Age      Pay     Name
4     10      PYTHON   25   1000.0   Bindhu
3      7  JavaScript   27  12000.0  Sarvesh
2     15  JavaScript   32   5000.0   Palani
1     12      python   27      NaN   Karthi
0     21      Python   35  15000.0    Indhu

In [196]:
df[0:1]

   EmpID   Skill  Age      Pay   Name
0     21  Python   35  15000.0  Indhu

### Selecting rows and columns using standard indexing

In [8]:
df[0:2]["EmpID"]

0    21
1    12
Name: EmpID, dtype: int64

### Setting index

In [23]:
df1=df.set_index("Name")
df1

         EmpID       Skill  Age      Pay
Name
Indhu       21      Python   35  15000.0
Karthi      12      python   27      NaN
Palani      15  JavaScript   32   5000.0
Sarvesh      7  JavaScript   27  12000.0
Bindhu      10      PYTHON   25   1000.0

### Selecting rows by using row_index values/labels in standard indexing

In [24]:
df1["Indhu":"Palani"]

        EmpID       Skill  Age      Pay
Name
Indhu      21      Python   35  15000.0
Karthi     12      python   27      NaN
Palani     15  JavaScript   32   5000.0

### Selecting rows  and columns by using row_index values/labels in standard indexing

In [25]:
df1["Indhu":"Palani"]["Age"]

Name
Indhu     35
Karthi    27
Palani    32
Name: Age, dtype: int64

### If we mention list of row_index or row_index alone in standard indexing,it will raise KeyError

In [200]:
#df1["Indhu","Palani"]

### selecting single row [iloc -> Access by integer]

In [32]:
df.iloc[0]

EmpID        21
Skill    Python
Age          35
Pay       15000
Name      Indhu
Name: 0, dtype: object

In [12]:
type(df.iloc[0])

pandas.core.series.Series

### Selecting multiple rows by using iloc

In [13]:
df.iloc[[0,1]]

   EmpID   Skill  Age      Pay    Name
0     21  Python   35  15000.0   Indhu
1     12  python   27      NaN  Karthi

In [14]:
type(df.iloc[[0,1]])

pandas.core.frame.DataFrame

In [33]:
df.iloc[[0,3]]

   EmpID       Skill  Age      Pay     Name
0     21      Python   35  15000.0    Indhu
3      7  JavaScript   27  12000.0  Sarvesh

### Selecting multiple rows and multiple columns using iloc

In [15]:
df.iloc[[0,1],[0,1]]

   EmpID   Skill
0     21  Python
1     12  python

### Selecting single row and multiple columns using iloc

In [16]:
df.iloc[[0],[0,1]]

   EmpID   Skill
0     21  Python

In [17]:
type(df.iloc[[0],[0,1]])

pandas.core.frame.DataFrame

### Selecting multiple rows and single column

In [18]:
df.iloc[[0,1],[0]]

   EmpID
0     21
1     12

In [37]:
df1

         EmpID       Skill  Age      Pay
Name
Indhu       21      Python   35  15000.0
Karthi      12      python   27      NaN
Palani      15  JavaScript   32   5000.0
Sarvesh      7  JavaScript   27  12000.0
Bindhu      10      PYTHON   25   1000.0

### Selecting rows after setting colum ad row_index

In [35]:
df1.iloc[[0,2]]

        EmpID       Skill  Age      Pay
Name
Indhu      21      Python   35  15000.0
Palani     15  JavaScript   32   5000.0

### If we mention column_index values it will raise IndexError

In [40]:
#df1.iloc[[0,2],["EmpID"]]

### If we mention row_index values it will raise ValueError

In [203]:
#df1.iloc[["Indhu","Palani"]]

In [201]:
#df1.iloc[["Indhu","Palani"],["EmpID"]]

## Indexing using loc

### Selecting single row using loc

In [64]:
df.loc[0]

EmpID        21
Skill    Python
Age          35
Pay       15000
Name      Indhu
Name: 0, dtype: object

In [59]:
df1.loc["Indhu"]

EmpID        21
Skill    Python
Age          35
Pay       15000
Name: Indhu, dtype: object

### Selecting multiple rows  using loc

In [60]:
df.loc[[0,1]]

   EmpID   Skill  Age      Pay    Name
0     21  Python   35  15000.0   Indhu
1     12  python   27      NaN  Karthi

In [61]:
df1.loc[["Indhu","Karthi"]]

        EmpID   Skill  Age      Pay
Name
Indhu      21  Python   35  15000.0
Karthi     12  python   27      NaN

In [65]:
#df1.loc[[0,1]]

### Selecting single row and single column  using loc

In [19]:
df.loc[[0],'EmpID']

0    21
Name: EmpID, dtype: int64

In [66]:
type(df.loc[[0],'EmpID'])

pandas.core.series.Series

### Selecting single row and multiple columns using loc

In [20]:
df.loc[[0],['EmpID','Skill']]

   EmpID   Skill
0     21  Python

In [68]:
df1.loc[["Indhu"],['EmpID','Skill']]

       EmpID   Skill
Name
Indhu     21  Python

### Selecting multiple rows and multiple columns

In [21]:
df.loc[[0,1],['EmpID','Skill']]

   EmpID   Skill
0     21  Python
1     12  python

### Slicing

### Using slice object in iloc.Stop index is exclusive

In [69]:
df.iloc[0:2]

   EmpID   Skill  Age      Pay    Name
0     21  Python   35  15000.0   Indhu
1     12  python   27      NaN  Karthi

In [84]:
df1.iloc[0:4:2,0:2]

        EmpID       Skill
Name
Indhu      21      Python
Palani     15  JavaScript

In [70]:
df.iloc[:2]

   EmpID   Skill  Age      Pay    Name
0     21  Python   35  15000.0   Indhu
1     12  python   27      NaN  Karthi

In [71]:
df.iloc[2:]

   EmpID       Skill  Age      Pay     Name
2     15  JavaScript   32   5000.0   Palani
3      7  JavaScript   27  12000.0  Sarvesh
4     10      PYTHON   25   1000.0   Bindhu

In [72]:
df.iloc[::-1]

   EmpID       Skill  Age      Pay     Name
4     10      PYTHON   25   1000.0   Bindhu
3      7  JavaScript   27  12000.0  Sarvesh
2     15  JavaScript   32   5000.0   Palani
1     12      python   27      NaN   Karthi
0     21      Python   35  15000.0    Indhu

In [73]:
df.iloc[::2]

   EmpID       Skill  Age      Pay    Name
0     21      Python   35  15000.0   Indhu
2     15  JavaScript   32   5000.0  Palani
4     10      PYTHON   25   1000.0  Bindhu

In [74]:
df.iloc[0:2,0:2]

   EmpID   Skill
0     21  Python
1     12  python

In [75]:
df.iloc[::2,0:2]

   EmpID       Skill
0     21      Python
2     15  JavaScript
4     10      PYTHON

### Using slice object in loc. Stop index is inclusive

In [92]:
df.loc[0:4:2]

   EmpID       Skill  Age      Pay    Name
0     21      Python   35  15000.0   Indhu
2     15  JavaScript   32   5000.0  Palani
4     10      PYTHON   25   1000.0  Bindhu

In [90]:
df1.loc["Indhu":"Palani":2]

        EmpID       Skill  Age      Pay
Name
Indhu      21      Python   35  15000.0
Palani     15  JavaScript   32   5000.0

In [93]:
df1.loc[::2,"EmpID":"Age"]

        EmpID       Skill  Age
Name
Indhu      21      Python   35
Palani     15  JavaScript   32
Bindhu     10      PYTHON   25

In [100]:
df1["Indhu":"Palani"]["Skill"]

Name
Indhu         Python
Karthi        python
Palani    JavaScript
Name: Skill, dtype: object

In [141]:
df.iloc[0:2,[0]]

   EmpID
0     21
1     12

In [142]:
df[0:2]["EmpID"]

0    21
1    12
Name: EmpID, dtype: int64

In [131]:
df.iloc[[0],[0]]

   EmpID
0     21

In [137]:
df.iloc[[0],[0]]

   EmpID
0     21

### Selecting single row and single column using loc in different ways.Return type is also different

In [133]:
df.loc[0,['EmpID']]

EmpID    21
Name: 0, dtype: object

In [136]:
type(df.loc[0,['EmpID']])

pandas.core.series.Series

In [124]:
df.loc[[0],'EmpID']

0    21
Name: EmpID, dtype: int64

In [135]:
type(
df.loc[[0],'EmpID'])

pandas.core.series.Series

In [134]:
df.loc[0,'EmpID']

21

## In loc, giving one input as label and other as a list of labels -> return type is series

In [138]:
df.loc[0,['EmpID','Skill']]

EmpID        21
Skill    Python
Name: 0, dtype: object

In [144]:
df.loc[[0,1],'EmpID']

0    21
1    12
Name: EmpID, dtype: int64

In [150]:
df1.loc["Indhu",['EmpID','Skill']]

EmpID        21
Skill    Python
Name: Indhu, dtype: object

In [155]:
df1.loc[["Indhu","Palani"],"EmpID"]

Name
Indhu     21
Palani    15
Name: EmpID, dtype: int64

## In loc, giving both row_index and column_ index as single lable  -> return type will be single value

In [146]:
df.loc[0,"EmpID"]

21

In [147]:
df1.loc["Indhu","EmpID"]

21

### In loc , giving both row_index and column index as list of labels  ->return type will be Dataframe

In [157]:
df.loc[[0],["EmpID"]]

   EmpID
0     21

In [158]:
df.loc[[0,1],["EmpID"]]

   EmpID
0     21
1     12

In [160]:
df.loc[[0,1],["EmpID","Age"]]

   EmpID  Age
0     21   35
1     12   27

In [162]:
df1.loc[["Indhu"],["EmpID"]]

       EmpID
Name
Indhu     21

### In loc, if we give both input as slice object, return type is dataframe. 
### Similarly one input as slice object and other one as list of labels means ,return type is dataframe

In [189]:
df.loc[0:2,["EmpID"]]

   EmpID
0     21
1     12
2     15

In [192]:
df.loc[0:2,"EmpID":"Age"]

   EmpID       Skill  Age
0     21      Python   35
1     12      python   27
2     15  JavaScript   32

In [194]:
df1.loc["Indhu":"Palani","EmpID":"Skill"]

        EmpID       Skill
Name
Indhu      21      Python
Karthi     12      python
Palani     15  JavaScript

### In iloc, giving both row_index and column_index as single integer, return type will be single value

In [164]:
df.iloc[0,1]

'Python'

In [165]:
df1.iloc[0,1]

'Python'

### In iloc,giving one input as integer and another as a list of integers, return type will be series

In [167]:
df.iloc[0,[1]]

Skill    Python
Name: 0, dtype: object

In [168]:
df.iloc[[0],1]

0    Python
Name: Skill, dtype: object

In [169]:
df.iloc[0,[0,1]]

EmpID        21
Skill    Python
Name: 0, dtype: object

In [172]:
df1.iloc[[0,1],0]

Name
Indhu     21
Karthi    12
Name: EmpID, dtype: int64

### In iloc , giving both input row_index and column_index as list of integers , return type will be dataframe

In [174]:
df.iloc[[0],[1]]

    Skill
0  Python

In [175]:
df1.iloc[[0],[1]]

        Skill
Name
Indhu  Python

In [177]:
df.iloc[[0,1],[0,1]]

   EmpID   Skill
0     21  Python
1     12  python

In [178]:
df1.iloc[[0,1],[0,1]]

        EmpID   Skill
Name
Indhu      21  Python
Karthi     12  python

### In iloc, If we give one input as slice and one input as integer, return type will be series

In [184]:
df.iloc[0:1,0]

0    21
Name: EmpID, dtype: int64

In [185]:
df1.iloc[0,0:2]

EmpID        21
Skill    Python
Name: Indhu, dtype: object

### In iloc, if we give both input as slice object,output will be dataframe.
### If we give one input as slice and another input as list of integer,return type will be dataframe

In [181]:
df1.iloc[0:1,[0]]

       EmpID
Name
Indhu     21

In [182]:
df1.iloc[0:1,0:1]

       EmpID
Name
Indhu     21

In [183]:
df.iloc[0:1,0:1]

   EmpID
0     21

In [195]:
df[0:1]["EmpID"]

0    21
Name: EmpID, dtype: int64

### Same input given in different formats. So different return types

In [211]:
df.loc[0,"EmpID"]

21

In [207]:
df.loc[0,["EmpID"]]

EmpID    21
Name: 0, dtype: object

In [208]:
df.loc[[0],"EmpID"]

0    21
Name: EmpID, dtype: int64

In [210]:
df.loc[[0],["EmpID"]]

   EmpID
0     21